//=================================================================================
//
//    Number Manager header
//    Author : Lin He                                作成日 : 2018/09/15
//
//=================================================================================

#ifndef _NUMBER_MANAGER_H_
#define _NUMBER_MANAGER_H_

#include "DirectX9.h"

//*****************************************************************************
// NumberManager Class
//*****************************************************************************
class NumberManager
{
	private:
		LPDIRECT3DTEXTURE9 texture_;

	public:
		NumberManager();

		~NumberManager();

		//=================================================================
		// [ 数字描画関数 ]
		//
		// [ Parameters ]
		// [int]	n	   : 描画する数字(0~9)
		// [float]	x, y   : 描画する座標
		//
		// [ Details ]
		// 数字nを座標(x,y)に描画する
		//=================================================================
		void DrawNumber(int n, float x, float y);

		//=================================================================
		// [ スコア描画関数 ]
		//
		// [ Parameters ]
		// [int]	score	: 描画するスコア
		// [float]	x, y    : 描画する座標
		//
		// [ Details ]
		// スコア(score)を座標(x,y)を右上座標にして、左に一個ずつ描画する
		//=================================================================
		void DrawScore(int score, float x, float y);
};

#endif